const PairReviews = [
  {
    name: "코드스테이츠 IM 25기 성석*님",
    comment:
      "막히는 부분이 생겼을 때 생각해보는 시간을 갖고 스스로 해결하려고 하시는 모습이 긍정적이었습니다. 해결방법을 제시하면서 소통을 할때는 귀기울여 들어주시고 의견 어필을 잘 해주셔서 예외상황이나 저도 처음 접하는 상황에 새로운 해결책을 찾을 수 있었습니다.",
  },

  {
    name: "코드스테이츠 IM 25기 임재*님",
    comment:
      "지치지 않고 계속해서 하고 있는 프로젝트를 개선시키기 위해 문제를 제시하고, 개선할 방안을 열정적으로 찾으시는 모습이 좋았습니다. 무엇보다 소통이 잘되어서 좋았습니다.",
  },
  {
    name: "코드스테이츠 IM 25기 김현*님",
    comment:
      "1. 호기심. 궁금한 점을 바로 찾아보고 해결하려는 공부 습관을 보며 많이 배웠습니다. 호기심은 호기심으로 이어지고 이런 방식은 하나를 알려줘도 세 개 이상 배울 수 있는 방식이라고 생각합니다. 2. 끈기. 호기심을 해결하기 위해 이해될 때까지 계속 파고 들어갑니다. 그동안 알려준 내용만 이해, 암기하며 너무 효율성을 찾고자 했던 제 모습을 반성하며 개발을 대하는 태도에 대해 한층 성장할 수 있었습니다. 3. 커뮤니케이션. 이머시브 첫 페어로 만나게 되었는데 의견 제시, 수용을 함에 있어 전혀 불편함이 없었습니다. 오히려 편한 분위기에서 페어 프로그래밍을 진행할 수 있었고 새로운 기술을 배우고 생각한대로 구현이 되었을 때 같이 기뻐할만큼 재밌고 뿌듯하게 3일을 보낼 수 있었습니다.",
  },
  {
    name: "코드스테이츠 IM 25기 한승*님",
    comment:
      "집요하게 파고들어 과제를 끝까지 완성하겠다는 의지가 인상 깊었습니다.",
  },
  {
    name: "코드스테이츠 IM 25기 추성*님",
    comment:
      "용재님은 진행되는 스프린트에 대해서 이해하기 위해 많은 노력을 하십니다. 사실 이전까지의 과정에서 저는 확실하게 이해하지 못한 부분이어도 문제를 풀거나 스프린트를 마무리하게 되면 다시금 돌아보지 않았던 것 같은데, (지금 돌이켜보면 귀찮아했던 것 같습니다.) 용재님은 진행과정에서도 이해가 가지 않으면 확실히 이해하시려 노력하십니다. 용재님의 그런 부분을 보며 제가 여지껏 너무 안일하게 공부를 해오지는 않았나라는 생각을 여러번 해봤던 것 같습니다. 더욱 주도적으로 이해하려 노력하시는 용재님의 모습이 굉장히 인상깊었다고 생각합니다.",
  },
  {
    name: "코드스테이츠 IM 25기 오승*님",
    comment:
      "편안한 분위기에서 모르는 부분은 상의하며 진행할수 있어서 좋았습니다.",
  },
  {
    name: "코드스테이츠 IM 25기 김지*님",
    comment:
      "과제 수행능력이 좋으시고 페어 하면서 원활하게 의사소통 했었네요 ㅎ 문제 해결능력도 뛰어나시고 집중력 또한 좋아보였습니다. 상대방의 페어 스타일을 존중 해 주셔서 더욱 편하게 할 수 있었던 것 같네요.ㅎ 코드 문제로 어려움이 있을때 화면공유하면서 코드를 서로 설명 해 주었던것을 보면친절하신듯 합니다 ㅎ 나중에 다시 뵐수 있었으면 좋겠네요 ㅎ.",
  },
  {
    name: "코드스테이츠 IM 25기 임관*님",
    comment:
      "코드스테이츠 꼼꼼하게 리팩토링을 하셔서 미처 확인하지 못하고 지나갔던 부분을 다시 한 번 생각함으써 개념을 잘 정리하게 되었습니다. 어려움을 겪고있는데도 차근차근히 살펴보시는 모습 역시 인상적이였습니다.",
  },
  {
    name: "코드스테이츠 IM 25기 원종*님",
    comment: "다른 분과의 협력을 적극적으로 해주셔서 도움이 되었습니다.",
  },
];

export default PairReviews;
